examples/Bellegoni_2023/emptyFetch/of7_kEpsilon/system/controlDict
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5000;

deltaT          1;

writeControl    timeStep;

writeInterval   5000;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
  "myLibABL.so"                      //kEpsilon
  // "myLibABLkOmegaSST.so"             //kOmegaSST
  // "myLibABLkOmegaSST_diffblend.so"   //kOmegaSST_F1blend
 );

functions
{
  #includeFunc residuals
  #includeFunc  inletGraph
  #includeFunc  incidentGraph
}


// ************************************************************************* //
