examples/Bellegoni_2023/emptyFetch/of7_kEpsilon/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{

    inlet
    {
        type            VelocityABL;
        #include        "include/ABLConditions"
    }

    outlet 
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    
    ground      
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    // building      
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }
    
    #include "include/sideAndTopPatches"

    top
    {
        //  Calculate horizontal shear stress to apply at top boundary
        // (Hargreaves & Wright, 2007: p. 358)
        // Note: rho (denisty) = 1 in OF
        
        type fixedShearStress;

        #include        "include/ABLConditions"
        #include        "../system/blockMeshDict"

        tau_x #calc     "pow($ustar,2)";
       
        tau ($tau_x 0 0);
        value uniform (0 0 0);
    }

}

// ************************************************************************* //
